##### Topics Covered Today
- Introduction
    - Fast and Efficient
    - In-Memory
    - Easy to handle missing data
    - Easy for Data Manipulation
    - Supports operations like aggregation, groupby, reshape, pivot, insertion, deletion and lot more
    - Supports Timeseries conversion 
- Creating DF
- Reading Data ffrom different Sources
- Writing a DF to a CSV file

Objective: Ability to read and write from different data sources, also to learn about creating our own data frames and finally cover some commonly used functionalities of Pandas

In [10]:
#import pandas library and provide alias name as pd
import pandas as pd

1. Creation an empty DF

In [11]:

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
companies = ["apple", "facebook", "google", "amazon"]
print(companies)
#Now converting it into a Data Frame
#df_companies1 = pd.DataFrame(companies)
#print(df_companies1)

['apple', 'facebook', 'google', 'amazon']

In [13]:
companies = [["Apple",111],["Facebook",222],["Google",333], ["Amazon", 444]]
df_companies2 = pd.DataFrame(companies,columns=['Company','Seq'])
print(df_companies2)

    Company  Seq
0     Apple  111
1  Facebook  222
2    Google  333
3    Amazon  444

In [14]:
pd.DataFrame({"Apple": ["iPhone", "ipad"], "Amazon": ["AWS", "Prime"]})

    Apple Amazon
0  iPhone    AWS
1    ipad  Prime

In [15]:
pd.DataFrame({"Apple": ["iPhone", "ipad"], "Amazon": ["AWS", "Prime"]}, index=['Details 1', 'Details 2'])

            Apple Amazon
Details 1  iPhone    AWS
Details 2    ipad  Prime

2. Reading Data from different source

In [16]:
csv_df = pd.read_csv('Data/Sample1.csv')
csv_df.head(5)

  Companies   Seq
0     Apple  1111
1    Google  2222
2  Facebook  3333
3    Amazon  4444

In [17]:
txt_df = pd.read_csv('Data/Sample1.txt', sep="\t")
txt_df.head(5)

  Companies   Seq
0     Apple  1111
1    Google  2222
2  Facebook  3333
3    Amazon  4444

3. Writing df to a file

In [18]:
companies = [["Apple",111],["Facebook",222],["Google",333], ["Amazon", 444]]
df_companies2 = pd.DataFrame(companies,columns=['Company','Seq'])
df_companies2.to_csv('Data/Write_to_file.csv')
#df_companies2.to_csv('Data/Write_to_file.csv', encoding='utf-8', index=False) # character encoding that can be as compact as ASCII

4. Basic Operations

In [19]:
companies3 = [["Apple",111],["Facebook",222],["Google",333], ["Amazon", 444], ["Tesla", 555], ["Zoom", 666], ["Microsoft", 777]]
df_companies3 = pd.DataFrame(companies3,columns=['Company','Seq'])
df_companies3.head()
#df_companies3.tail()

    Company  Seq
0     Apple  111
1  Facebook  222
2    Google  333
3    Amazon  444
4     Tesla  555

In [20]:
print(df_companies3.T)

             0         1       2       3      4     5          6
Company  Apple  Facebook  Google  Amazon  Tesla  Zoom  Microsoft
Seq        111       222     333     444    555   666        777

In [21]:
print(df_companies3.ndim)
print(df_companies3.shape)
print(df_companies3.size)

2
(7, 2)
14

To Try
- Create a data frame from a list
- Create a data frame from a tuple
- Create a data frame from a list of dictionaries
- Download the data from this kaggle source - https://www.kaggle.com/heptapod/titanic as csv and read it using pandas
- Write back the above kaggle dataset back to the system as a CSV file